10 класс
Как называется тип данных, которым обозначаются строки
int
float
str
dict
set
Какая функция позволяет вывести какую-либо информацию в консоль (напечатать её)?
input()
int()
len()
print()
x = "Программа"
Как получить букву "о" из строки в переменой x?
x["o"]
x[2]
x(2)
x[3]
x(-3)
if (x * 2 <= y + x) or (x == 0):
    print('YES')
else:
    print("NO")
-----------------
Для каких х и у программа выведет слово YES (возможны несколько вариантов ответа)
x = 3, y = 3
x = 6, y = 5
x = 2, y = 12
x = 0, y = 2
x = 0, y = -1
x = 19312, y = 5432
x = 'Пока
y = 'Привет'
if x[0] == y[0]:
    print(y[2:4])
else:
    print(x[1:3])
-----------------
Что выведет программа?
ок
Привет
иве
ив
ока
Пока
Ошибку
x = 'Привет'
y = x + x[-3:]
print(y)
-----------------
Что выведет программа?
Привет
Приветвет
ПриветПривет
Приветт
ветПривет
етПриветп
Ошибку
x = "23"
y = x + 100
-----------------
Что выведет программа?
123
10023
23100
231
Ошибку
Что выведет код?
________________
x = 10
y = x
for i in range(10):
    y += 1
print(y, x)
y, x
10 10
20 10
1 10
11 20
Что выведет код?
________________
c = 1
for i in range(5, 7):
    print(i * 2)
    c += 1
print(c)
10 12
25 36 12
10 12 14 4
10 12 3
11 20
Что выведет код?
________________
x = 100
y = 0
while x > 10:
    x = x // 2
    y += 1
print(y)
3
1
5
6
4
Напишите код, решающий данную задачу:
______________________________
Даны два целых числа (input()) A и B (при этом A ≤ B). Выведите все числа от A до B включительно.
Напишите код, решающий данную задачу:
______________________________
По данному целому числу N распечатайте все квадраты натуральных чисел, не превосходящие N, в порядке возрастания.
